Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>symbol</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rank</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СправочникВалютыСервер/Ext/Module.bsl
Процедура ОбновитьСписокВалют() Экспорт
	
	//https://api.coinmarketcap.com/v1/ticker/	
	uriПространстваИмен = "https://api.coinmarketcap.com";
	команда = "ticker";
	
	сервер = "api.coinmarketcap.com";
	ресурс = "/v1/" + команда + "/";
	параметрыКоманды = "limit=10";
	
	соединение = Новый HTTPСоединение(сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	ресурсПараметры = ресурс+"?"+параметрыКоманды;
	
	запрос = Новый HTTPЗапрос(ресурсПараметры);
	
	
	ответСервера = Соединение.Получить(запрос);
	
	Сообщить(ответСервера.КодСостояния);
	
	
	чтениеJSON = Новый ЧтениеJSON;
	чтениеJSON.УстановитьСтроку(ответСервера.ПолучитьТелоКакСтроку());
	
	объектXDTO = ФабрикаXDTO.ПрочитатьJSON(чтениеJSON, ФабрикаXDTO.Тип(uriПространстваИмен, "TickerResponse"));
	
	
	НачатьТранзакцию();
	
	Для Каждого инструмент Из объектXDTO.Tickers Цикл
		
		id = инструмент.id;
		
		сВалюты = Справочники.Валюты.НайтиПоРеквизиту("id", id);
		
		Если сВалюты.Пустая() Тогда
			оВалюты = Справочники.Валюты.СоздатьЭлемент();
		Иначе
			оВалюты = сВалюты.ПолучитьОбъект();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(оВалюты, инструмент, "id,symbol,rank");
		
		оВалюты.Наименование = инструмент.name;
		
		Если ПроверкаДанныхСервер.ОбъектИзменён(оВалюты) Тогда
			оВалюты.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
